app/views/powers/index.html.haml

SELECT "powers".* FROM "powers"
---
#powers_list
  - Power.all.each do |power|