app/views/powers/show.html.haml

  %hr.m-y-2
  - if current_hero.powers.exists?(@power.id)
---
SELECT  1 AS one FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1 AND "powers"."id" = $2 LIMIT 1  [["hero_id", 2], ["id", 6]]