app/views/stopped_crimes/index.html.haml

SELECT  "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1  ORDER BY "powers"."id" DESC LIMIT 1  [["hero_id", 1]]
SELECT  1 AS one FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1 LIMIT 1  [["hero_id", 1]]
---
      %h5.list-group-item Current Powers:
      - unless current_hero.powers.empty?

SELECT "stopped_crimes".* FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 1]]
SELECT COUNT(*) FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 7]]
---
        = current_hero.name
      %h6.card-text Stopped Crimes: #{current_hero.stopped_crimes.count}
  .card.col-md-3.col-md-offset-1