app/controllers/admin/heros_controller.rb

SELECT  "stopped_crimes".* FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  ORDER BY "stopped_crimes"."id" DESC LIMIT 1  [["hero_id", 2]]
SELECT COUNT(*) FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 4]]
---
  def show
    @most_recent = @hero.stopped_crimes.last unless @hero.stopped_crimes.empty?

SELECT  "heros".* FROM "heros" WHERE "heros"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_hero
    @hero = Hero.find(params[:id])