app/controllers/admin/heros_controller.rb

  def show
    @recent_power = @hero.powers.last
---
SELECT  "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1  ORDER BY "powers"."id" DESC LIMIT 1  [["hero_id", 4]]