app/controllers/admin/powers_controller.rb

  def index
    @powers = Power.order(:cost)
---
SELECT "powers".* FROM "powers"  ORDER BY "powers"."cost" ASC

  def create
    @power = Power.new(power_params)
    if @power.save
---
INSERT INTO "powers" ("name", "cost", "image_url") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Telepathy"], ["cost", 30], ["image_url", "#<MiniMagick::Image:0x007fdd48b3e548>"]]

  def set_power
    @power = Power.find(params[:id])
---
SELECT  "powers".* FROM "powers" WHERE "powers"."id" = $1 LIMIT 1  [["id", 7]]