app/controllers/admin/stopped_crimes_controller.rb

  def set_stopped_crime
    @stopped_crime = StoppedCrime.find(params[:id])
---
SELECT  "stopped_crimes".* FROM "stopped_crimes" WHERE "stopped_crimes"."id" = $1 LIMIT 1  [["id", 19]]