app/views/admin/heros/index.html.haml

.row#all_heroes
  - Hero.where(:role => 0).each do |hero|
    .card.col-md-3
---
SELECT "heros".* FROM "heros" WHERE "heros"."role" = $1  [["role", 0]]

        = link_to hero.name, admin_hero_path(hero)
        %p Total crimes stopped: #{hero.stopped_crimes.count}
        - unless hero.powers.empty?
---
SELECT COUNT(*) FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 2]]
SELECT  "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1  ORDER BY "powers"."id" DESC LIMIT 1  [["hero_id", 2]]
SELECT  1 AS one FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1 LIMIT 1  [["hero_id", 2]]