app/views/admin/heros/show.html.haml

        = @hero.name
      %h6.card-text Stopped Crimes: #{@hero.stopped_crimes.count}
    .dropdown.action-buttons
---
SELECT  "stopped_crimes".* FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  ORDER BY "stopped_crimes"."id" DESC LIMIT 1  [["hero_id", 2]]
SELECT COUNT(*) FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 3]]