app/views/admin/heros/shared/_form.html.haml

  %br/
  - StoppedCrime.all.each do |stopped_crime|
    = check_box_tag :stopped_crimes, stopped_crime.id, @hero.stopped_crimes.include?(stopped_crime), :name => "hero[stopped_crime_ids][]", :id => "stopped_crime_#{stopped_crime.id}"
---
SELECT "stopped_crimes".* FROM "stopped_crimes"
SELECT  1 AS one FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1 AND "stopped_crimes"."id" = $2 LIMIT 1  [["hero_id", 4], ["id", 7]]