app/controllers/api/v1/admin/heros_controller.rb

  def index
    respond_with Hero.where(role: 0)
---
SELECT "heros".* FROM "heros" WHERE "heros"."role" = $1  [["role", 0]]