app/controllers/powers_controller.rb

SELECT COUNT(*) FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1  [["hero_id", 2]]
---
  def show
    @purchase = true if current_hero.stopped_crimes.count > @power.cost.to_i

SELECT  "powers".* FROM "powers" WHERE "powers"."id" = $1 LIMIT 1  [["id", 5]]
---
  def set_power
    @power = Power.find(params[:id])