app/controllers/sessions_controller.rb

  def create
    hero = Hero.find_by(:name => params[:session][:name])
---
SELECT  "heros".* FROM "heros" WHERE "heros"."name" = $1 LIMIT 1  [["name", "Toxin Machine"]]