app/controllers/stopped_crimes_controller.rb

SELECT  "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = $1  ORDER BY "powers"."id" DESC LIMIT 1  [["hero_id", 1]]
---
  def index
    @recent_power = current_hero.powers.last unless current_hero.powers.empty?

SELECT  "stopped_crimes".* FROM "stopped_crimes" WHERE "stopped_crimes"."hero_id" = $1 AND "stopped_crimes"."id" = $2 LIMIT 1  [["hero_id", 7], ["id", 7]]
---
  def show
    @stopped_crime = current_hero.stopped_crimes.find(params[:id])